## Setup

### Importing Libraries

In [1]:
# Import necessary libraries, etc.
import pandas as pd
from configparser import ConfigParser
%load_ext sql

### Connecting to PostgreSQL Database

In [2]:
# Obtaining connection string to connect with PostgreSQL database
# Format:  "postgresql://username:{password}@localhost:5432/northwind"
parser = ConfigParser()
_ = parser.read('nb.cfg')
conn_string = parser.get('my_db', 'conn_string')

In [3]:
# SQL statement for creating connection
sql = f"""
{conn_string}
"""
# Connecting
%sql {sql}

## Exploring the Northwind Database

In [10]:
%%sql
SELECT table_name AS name,
       table_type AS type
  FROM information_schema.tables
 WHERE table_schema = 'public' AND table_type IN ('BASE TABLE', 'VIEW');

 * postgresql://postgres:***@localhost:5432/northwind
14 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE')]

#### Observations:
- The database contains 14 tables and is consistent with the original schema.  
- The 6 tables in the modified schema are all accounted for.

### Checking Samples of Each Table

### `customers`

In [13]:
%%sql
SELECT *
  FROM customers
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745')]

#### Observations:
- Note that the column `notes` is of text type and will throw errors during retrieval in python.

### `employees`

In [16]:
%%sql
SELECT employee_id, last_name, first_name, title, hire_date, city, region, country
  FROM employees
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), 'Seattle', 'WA', 'USA'),
 (2, 'Fuller', 'Andrew', 'Vice President, Sales', datetime.date(1992, 8, 14), 'Tacoma', 'WA', 'USA')]

### `orders`

In [17]:
%%sql
SELECT *
  FROM orders
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany')]

### `categories`

In [19]:
%%sql
SELECT category_name, description
  FROM categories
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

#### Observations:
- Note that the `picture` column will throw an error in python as bytea type regarding retrieval and pickling.

### `products`

In [20]:
%%sql
SELECT *
  FROM products
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1)]

### `order_details`

In [21]:
%%sql
SELECT *
  FROM order_details
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(10248, 11, 14.0, 12, 0.0), (10248, 42, 9.8, 10, 0.0)]

### Creating Views for Reuse

### `customers_orders_view`

In [29]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('customers', 'orders')
    ;

 * postgresql://postgres:***@localhost:5432/northwind
25 rows affected.

[('customers', 'customer_id'),
 ('customers', 'company_name'),
 ('customers', 'contact_name'),
 ('customers', 'contact_title'),
 ('customers', 'address'),
 ('customers', 'city'),
 ('customers', 'region'),
 ('customers', 'postal_code'),
 ('customers', 'country'),
 ('customers', 'phone'),
 ('customers', 'fax'),
 ('orders', 'order_id'),
 ('orders', 'customer_id'),
 ('orders', 'employee_id'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'freight'),
 ('orders', 'ship_name'),
 ('orders', 'ship_address'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country')]

In [37]:
%%sql
CREATE OR REPLACE VIEW customers_orders_view AS
SELECT o.*, 
       c.company_name, c.contact_name, c.contact_title, c.address, c.city, c.region, c.postal_code, c.country, c.phone, c.fax
  FROM customers c
  JOIN orders o
    ON c.customer_id = o.customer_id
;

SELECT * FROM customers_orders_view LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', '26.47.15.10', '26.47.15.11'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Toms Spezialitäten', 'Karin Josephs', 'Marketing Manager', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', '0251-031259', '0251-035695')]

### `orders_order_details_products_view`

In [40]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('orders', 'order_details', 'products')
 ORDER BY table_name;

 * postgresql://postgres:***@localhost:5432/northwind
29 rows affected.

[('order_details', 'product_id'),
 ('order_details', 'unit_price'),
 ('order_details', 'order_id'),
 ('order_details', 'quantity'),
 ('order_details', 'discount'),
 ('orders', 'ship_address'),
 ('orders', 'order_id'),
 ('orders', 'freight'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'customer_id'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country'),
 ('orders', 'ship_name'),
 ('orders', 'employee_id'),
 ('products', 'supplier_id'),
 ('products', 'category_id'),
 ('products', 'unit_price'),
 ('products', 'units_in_stock'),
 ('products', 'units_on_order'),
 ('products', 'reorder_level'),
 ('products', 'discontinued'),
 ('products', 'product_id'),
 ('products', 'quantity_per_unit'),
 ('products', 'product_name')]

In [56]:
%%sql
CREATE OR REPLACE VIEW orders_order_details_product_view AS
SELECT o.*,
       od.product_id, od.unit_price AS unit_price_on_order, od.quantity, od.discount,
       p.supplier_id, p.category_id, p.unit_price AS unit_price_product, p.units_in_stock, p.units_on_order, p.reorder_level, p.discontinued, p.quantity_per_unit, p.product_name
  FROM orders o
  JOIN order_details od
    ON o.order_id = od.order_id
  JOIN products p
    ON od.product_id = p.product_id
;

SELECT *
  FROM orders_order_details_product_view
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 11, 14.0, 12, 0.0, 5, 4, 21.0, 22, 30, 30, 0, '1 kg pkg.', 'Queso Cabrales'),
 (10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 42, 9.8, 10, 0.0, 20, 5, 14.0, 26, 0, 0, 1, '32 - 1 kg pkgs.', 'Singaporean Hokkien Fried Mee')]

### `employees_orders_view`

In [44]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('employees', 'orders');

 * postgresql://postgres:***@localhost:5432/northwind
32 rows affected.

[('employees', 'employee_id'),
 ('employees', 'last_name'),
 ('employees', 'first_name'),
 ('employees', 'title'),
 ('employees', 'title_of_courtesy'),
 ('employees', 'birth_date'),
 ('employees', 'hire_date'),
 ('employees', 'address'),
 ('employees', 'city'),
 ('employees', 'region'),
 ('employees', 'postal_code'),
 ('employees', 'country'),
 ('employees', 'home_phone'),
 ('employees', 'extension'),
 ('employees', 'photo'),
 ('employees', 'notes'),
 ('employees', 'reports_to'),
 ('employees', 'photo_path'),
 ('orders', 'order_id'),
 ('orders', 'customer_id'),
 ('orders', 'employee_id'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'freight'),
 ('orders', 'ship_name'),
 ('orders', 'ship_address'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country')]

In [48]:
%%sql
CREATE OR REPLACE VIEW employees_orders_view AS
SELECT o.*,
       e.last_name, e.first_name, e.title, e.title_of_courtesy, e.birth_date, e.hire_date, e.address, 
       e.city, e.region, e.postal_code, e.country, e.home_phone, e.extension, e.reports_to, e.photo_path
  FROM orders o
  JOIN employees e
    ON o.employee_id = e.employee_id
;

SELECT *
  FROM employees_orders_view
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Buchanan', 'Steven', 'Sales Manager', 'Mr.', datetime.date(1955, 3, 4), datetime.date(1993, 10, 17), '14 Garrett Hill', 'London', None, 'SW1 8JR', 'UK', '(71) 555-4848', '3453', 2, 'http://accweb/emmployees/buchanan.bmp'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Suyama', 'Michael', 'Sales Representative', 'Mr.', datetime.date(1963, 7, 2), datetime.date(1993, 10, 17), 'Coventry House\\nMiner Rd.', 'London', None, 'EC2 7JR', 'UK', '(71) 555-7773', '428', 5, 'http://accweb/emmployees/davolio.bmp')]

## Ranking Employee Sales Performance

In [57]:
%%sql
SELECT table_name
  FROM information_schema.views
 WHERE table_schema = 'public';

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('customers_orders_view',),
 ('employees_orders_view',),
 ('orders_order_details_product_view',)]

In [75]:
%%sql
WITH employee_orders_cte AS (
SELECT e.employee_id, 
       e.last_name,
       e.first_name,
       e.title, 
       e.hire_date, 
       e.city,
       e.region,
       e.country,
       e.reports_to,
       e.photo_path, 
       o.order_id, 
       o.order_date,
       o.product_id,
       o.unit_price_on_order,
       o.quantity, 
       o.discount, 
       o.unit_price_product,
       o.product_name
  FROM employees_orders_view e
  JOIN orders_order_details_product_view o
    ON e.order_id = o.order_id
)

SELECT employee_id, first_name || ' ' || last_name AS name, ROUND(SUM(unit_price_on_order*quantity)::NUMERIC, 2) AS total_sales,
       RANK() OVER(ORDER BY ROUND(SUM(unit_price_on_order*quantity)::NUMERIC) DESC) AS rank
  FROM employee_orders_cte
 GROUP BY employee_id, first_name || ' ' || last_name;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, 'Margaret Peacock', Decimal('250187.45'), 1),
 (3, 'Janet Leverling', Decimal('213051.30'), 2),
 (1, 'Nancy Davolio', Decimal('202143.71'), 3),
 (2, 'Andrew Fuller', Decimal('177749.26'), 4),
 (7, 'Robert King', Decimal('141295.99'), 5),
 (8, 'Laura Callahan', Decimal('133301.03'), 6),
 (9, 'Anne Dodsworth', Decimal('82964.00'), 7),
 (6, 'Michael Suyama', Decimal('78198.10'), 8),
 (5, 'Steven Buchanan', Decimal('75567.75'), 9)]